In [4]:
import pandas as pd
import numpy as np

## Getting to Know Pandas Datas Structures

In [5]:
revenues = pd.Series([5555, 7000, 1980])

In [6]:
revenues

0    5555
1    7000
2    1980
dtype: int64

In [7]:
revenues.values

array([5555, 7000, 1980], dtype=int64)

In [8]:
revenues.index

RangeIndex(start=0, stop=3, step=1)

In [9]:
city_revenues = pd.Series(
    [4200, 8000, 6500],
    index=["Amsterdam", "toronto", "Tokyo"]
)
city_revenues

Amsterdam    4200
toronto      8000
Tokyo        6500
dtype: int64

In [10]:
city_revenues.index

Index(['Amsterdam', 'toronto', 'Tokyo'], dtype='object')

In [11]:
city_employee_count = pd.Series({"Amsterdam":5, "Tokyo" :8})
city_employee_count

Amsterdam    5
Tokyo        8
dtype: int64

In [12]:
city_employee_count.keys()

Index(['Amsterdam', 'Tokyo'], dtype='object')

In [13]:
"Tokyo" in city_employee_count

True

# dataframe

In [14]:
city_revenues

Amsterdam    4200
toronto      8000
Tokyo        6500
dtype: int64

In [15]:
city_employee_count

Amsterdam    5
Tokyo        8
dtype: int64

In [46]:
city_data = pd.DataFrame({
    "revenue": city_revenues,
    "employee_count": city_employee_count
})

In [17]:
city_data

           revenue  employeee_count
Amsterdam     4200              5.0
Tokyo         6500              8.0
toronto       8000              NaN

In [18]:
city_data.index

Index(['Amsterdam', 'Tokyo', 'toronto'], dtype='object')

In [19]:
city_data.values

array([[4.2e+03, 5.0e+00],
       [6.5e+03, 8.0e+00],
       [8.0e+03,     nan]])

In [20]:
city_data.axes

[Index(['Amsterdam', 'Tokyo', 'toronto'], dtype='object'),
 Index(['revenue', 'employeee_count'], dtype='object')]

In [45]:
city_data.axes[1] # kolom
#city_data.axes[0] # baris

Index(['revenue', 'employeee_count'], dtype='object')

In [22]:
city_revenues

Amsterdam    4200
toronto      8000
Tokyo        6500
dtype: int64

In [23]:
city_revenues["Amsterdam"]

4200

In [24]:
city_revenues[1]

8000

In [25]:
city_revenues[0:2]

Amsterdam    4200
toronto      8000
dtype: int64

In [26]:
colors = pd.Series(
    ["red", "purple", "blue", "green", "yellow"],
    index=[1, 2, 3, 5, 8]
)

In [27]:
colors

1       red
2    purple
3      blue
5     green
8    yellow
dtype: object

In [28]:
colors.loc[1:3]

1       red
2    purple
3      blue
dtype: object

In [29]:
colors.iloc[1:3]

2    purple
3      blue
dtype: object

In [30]:
city_data.loc["Amsterdam", ""]

revenue            4200.0
employeee_count       5.0
Name: Amsterdam, dtype: float64

In [36]:
city_data.iloc[1:3]

         revenue  employeee_count
Tokyo       6500              8.0
toronto     8000              NaN

In [49]:
city_data

           revenue  employee_count
Amsterdam     4200             5.0
Tokyo         6500             8.0
toronto       8000             NaN

In [50]:
city_data.loc["Amsterdam":"Tokyo", ["revenue", "employee_count"]]

           revenue  employee_count
Amsterdam     4200             5.0
Tokyo         6500             8.0

In [51]:
further_city_data = pd.DataFrame(
    {"revenue": [7000, 3400], "employee_count": [2, 2]},
    index=["New York", "Barcelona"]
)

In [52]:
further_city_data

           revenue  employee_count
New York      7000               2
Barcelona     3400               2

In [53]:
city_data

           revenue  employee_count
Amsterdam     4200             5.0
Tokyo         6500             8.0
toronto       8000             NaN

In [55]:
#menggabungkan data

all_city_data = pd.concat([city_data, further_city_data], sort=False)

all_city_data

           revenue  employee_count
Amsterdam     4200             5.0
Tokyo         6500             8.0
toronto       8000             NaN
New York      7000             2.0
Barcelona     3400             2.0

In [57]:
city_countries = pd.DataFrame({
    "country": ["Holland", "Japan", "Holland", "Canada", "Spain"],
    "capital": [1, 1, 0, 0, 0]},
    index=["Amsterdam", "Tokyo", "Rotterdam", "Toronto", "Barcelona"]
)

In [58]:
city_countries

           country  capital
Amsterdam  Holland        1
Tokyo        Japan        1
Rotterdam  Holland        0
Toronto     Canada        0
Barcelona    Spain        0

In [59]:
all_city_data

           revenue  employee_count
Amsterdam     4200             5.0
Tokyo         6500             8.0
toronto       8000             NaN
New York      7000             2.0
Barcelona     3400             2.0

In [65]:
cities = pd.concat([all_city_data, city_countries], axis=1, sort=False)
cities

           revenue  employee_count  country  capital
Amsterdam   4200.0             5.0  Holland      1.0
Tokyo       6500.0             8.0    Japan      1.0
toronto     8000.0             NaN      NaN      NaN
New York    7000.0             2.0      NaN      NaN
Barcelona   3400.0             2.0    Spain      0.0
Rotterdam      NaN             NaN  Holland      0.0
Toronto        NaN             NaN   Canada      0.0

In [69]:
pd.concat([all_city_data, city_countries], axis=1,join='inner')

           revenue  employee_count  country  capital
Amsterdam     4200             5.0  Holland        1
Tokyo         6500             8.0    Japan        1
Barcelona     3400             2.0    Spain        0

In [70]:
countries = pd.DataFrame({
    "population_millions": [17, 127, 37],
    "continent": ["Europe", "Asia", "North America"]
}, index=["Holland", "Japan", "Canada"])

In [71]:
countries

         population_millions      continent
Holland                   17         Europe
Japan                    127           Asia
Canada                    37  North America

In [72]:
cities

           revenue  employee_count  country  capital
Amsterdam   4200.0             5.0  Holland      1.0
Tokyo       6500.0             8.0    Japan      1.0
toronto     8000.0             NaN      NaN      NaN
New York    7000.0             2.0      NaN      NaN
Barcelona   3400.0             2.0    Spain      0.0
Rotterdam      NaN             NaN  Holland      0.0
Toronto        NaN             NaN   Canada      0.0

In [76]:
pd.merge(cities, countries, right_on="continent", left_index=True)

Empty DataFrame
Columns: [revenue, employee_count, country, capital, population_millions, continent]
Index: []

In [78]:
pd.merge(
    cities,
    countries,
    left_on="country",
    right_index=True,
    how="right"
)

,revenue,employee_count,country,capital,population_millions,continent
Amsterdam,4200.0,5.0,Holland,1.0,17,Europe
Rotterdam,NaN,NaN,Holland,0.0,17,Europe
Tokyo,6500.0,8.0,Japan,1.0,127,Asia
Toronto,NaN,NaN,Canada,0.0,37,North America